examples/flows/agentic/compiled/human_in_the_loop/flow.mmd
flowchart TD
    %% Flow: human_in_the_loop

    approval_gate[approval_gate]
    end_human_in_the_loop([end_human_in_the_loop])
    executor[executor]
    notifier[notifier]
    proposal_generator[proposal_generator]
    revision_agent[revision_agent]
    router_human_in_the_loop_line_58_seq_7{{router_human_in_the_loop_line_58_seq_7}}
    router_human_in_the_loop_line_60_while_1{{router_human_in_the_loop_line_60_while_1}}
    router_human_in_the_loop_line_61_seq_6{{router_human_in_the_loop_line_61_seq_6}}
    router_human_in_the_loop_line_70_if_5{{router_human_in_the_loop_line_70_if_5}}
    router_human_in_the_loop_line_75_if_4{{router_human_in_the_loop_line_75_if_4}}
    router_human_in_the_loop_line_79_if_3{{router_human_in_the_loop_line_79_if_3}}
    router_human_in_the_loop_line_80_seq_2{{router_human_in_the_loop_line_80_seq_2}}
    start_human_in_the_loop([start_human_in_the_loop])

    start_human_in_the_loop --> router_human_in_the_loop_line_58_seq_7
    router_human_in_the_loop_line_80_seq_2 --> notifier
    router_human_in_the_loop_line_79_if_3 -->|p['attempt'] >= 3| router_human_in_the_loop_line_80_seq_2
    router_human_in_the_loop_line_75_if_4 -->|p.get('approval') == 'rejected'| revision_agent
    router_human_in_the_loop_line_70_if_5 -->|not (p.get('approval') in ('approved', 'modified'))| router_human_in_the_loop_line_75_if_4
    router_human_in_the_loop_line_70_if_5 -->|not (p.get('approval') in ('approved', 'modified'))| router_human_in_the_loop_line_79_if_3
    router_human_in_the_loop_line_70_if_5 -->|p.get('approval') in ('approved', 'modified')| executor
    router_human_in_the_loop_line_70_if_5 -->|p.get('approval') in ('approved', 'modified')| notifier
    router_human_in_the_loop_line_61_seq_6 --> proposal_generator
    router_human_in_the_loop_line_61_seq_6 --> approval_gate
    router_human_in_the_loop_line_61_seq_6 --> router_human_in_the_loop_line_70_if_5
    router_human_in_the_loop_line_60_while_1 --> router_human_in_the_loop_line_61_seq_6
    router_human_in_the_loop_line_60_while_1 --> router_human_in_the_loop_line_60_while_1
    router_human_in_the_loop_line_58_seq_7 --> router_human_in_the_loop_line_60_while_1
